<a href="https://colab.research.google.com/github/whatsupabhijit/py_rambling/blob/master/pandas/panda.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

>[Pandas](#scrollTo=dOlkheh4Z1wX)

>[Series](#scrollTo=TTeZ84PhacEh)

>[Data Frame](#scrollTo=-YfwJSqBfS8I)

>[Panel](#scrollTo=YL4siMbofqwZ)

>[Data Access](#scrollTo=LO60AuW3_YGw)

>[Knowing a Series](#scrollTo=e-do3ytA7dcM)

>[Knowing a DataFrame](#scrollTo=6xe4amUS8I5m)

>[Pandas I/O](#scrollTo=rNN1p_6G-R4J)

>[How to read csv file from an url](#scrollTo=OmHqJ1csErJf)

>[How to deal with large datasets in smaller chunks](#scrollTo=uj0qCHjwK5yL)

>[Indexing](#scrollTo=i4tKTogSUCmt)

>[Single Level Indexing](#scrollTo=17zhQ8yCYHYG)

>[Date Level Indexing](#scrollTo=ArvjCQDeeH61)

>[Multi Level Indexing / Hierarchical indexing](#scrollTo=rwnqJr9XiDr6)

>[Data Cleaning](#scrollTo=Zk1NWgMjwY29)

>[Data Aggregation](#scrollTo=LtZlp0z36DtP)

# **Pandas**

- `Pandas` is a popular Python data analysis tool.

- It provides easy to use and highly efficient data structures.

- These data structures deal with numeric or labeled data, stored in the form of tables

**Data Structures in Pandas**

Three fundamental data structures used in pandas are,

- Series: A 1-D array.

- Data Frame: A 2-D array or two or more Series joined together

- Panel: A 3-D array

# **Series ** 

is a 1-D array, holding data values of a single variable, captured from multiple observations.

Few examples are:

1. Height of each student, belonging to a Class 'C'.''
2. Amount of daily rainfall received at Station 'X', in July 2017
3. Total sales of a product 'P' in every quarter of 2016.

In [1]:
!pip install panda
!pip install request

Collecting panda
  Downloading https://files.pythonhosted.org/packages/79/03/74996420528fe488ce17c42b6400531c8067d7eb661c304fa3aa8fdad17c/panda-0.3.1.tar.gz
Requirement already satisfied: setuptools in /usr/local/lib/python3.6/dist-packages (from panda) (40.6.2)
Requirement already satisfied: requests in /usr/local/lib/python3.6/dist-packages (from panda) (2.18.4)
Requirement already satisfied: urllib3<1.23,>=1.21.1 in /usr/local/lib/python3.6/dist-packages (from requests->panda) (1.22)
Requirement already satisfied: idna<2.7,>=2.5 in /usr/local/lib/python3.6/dist-packages (from requests->panda) (2.6)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in /usr/local/lib/python3.6/dist-packages (from requests->panda) (3.0.4)
Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.6/dist-packages (from requests->panda) (2018.10.15)
Building wheels for collected packages: panda
  Running setup.py bdist_wheel for panda ... - done
  Stored in directory: /root/.cache/pip/wheels/c6/c8/45/06ed898b0bb401c1ff207dbb05b1587ff28860a236d98b1996
Successfully built panda
Installing collected packages: panda
Successfully installed panda-0.3.1
Collecting request
  Downloading https://files.pythonhosted.org/packages/14/03/3985ca165063f8825be231383df7e214551a074b69c8358034b5a6c6d556/request-2018.11.20-py2.py3-none-any.whl
Collecting get (from request)
  Downloading https://files.pythonhosted.org/packages/77/50/a8f316f095765b6299791f8a2263893a01856036be1c377170a91e4696ed/get-2018.11.19-py2.py3-none-any.whl
Requirement already satisfied: setuptools in /usr/local/lib/python3.6/dist-packages (from request) (40.6.2)
Collecting post (from request)
  Downloading https://files.pythonhosted.org/packages/60/bf/9e3a234021486d3f25edda957f82c7228a6b4ce5b413bc6e771f634a6ba9/post-2018.11.20-py2.py3-none-any.whl
Collecting query-string (from get->request)
  Downloading https://files.pythonhosted.org/packages/a5/b6/7d896d6cdc0660275512e8835ac27ecdddf3540adb8375bb2e5b5ccb56bc/query_string-2018.11.20-py2.py3-none-any.whl
Collecting public (from query-string->get->request)
  Downloading https://files.pythonhosted.org/packages/36/c8/6dbeeeeb5ae9d897873df6bcdf4141cf8f160fa1e75a8a62d53535ddd19f/public-2018.11.20-py2.py3-none-any.whl
Installing collected packages: public, query-string, get, post, request
Successfully installed get-2018.11.19 post-2018.11.20 public-2018.11.20 query-string-2018.11.20 request-2018.11.20

In [0]:
import numpy as np
import pandas as pd   # mind the extra 's' in pandas as importing panda alone gives you error

In [3]:
## creating panda series from a dictionary

d = {'Math': 180, 'Physics': 157, 'Chemistry:': 157}
pd.Series(d)

Chemistry:    157
Math          180
Physics       157
dtype: int64

In [4]:
# Creating a panda series from numpy

n = 30 + 25 * np.random.randn(3) 

pd.Series(n, index = ['Math', 'Physics', 'Chemistry'])

Math         36.354404
Physics      44.735641
Chemistry    62.326611
dtype: float64

**Problem 1.1**
Create a series named heights_A with values 176.2, 158.4, 167.6, 156.2, and 161.4, which represent heights of 5 students of class A.

Label each student as s1, s2, s3, s4, and s5.

Determine the shape of heights_A and display it.

In [5]:
ht = [176.2, 158.4, 167.6, 156.2, 161.4]

heights_A = pd.Series(ht, index = ['s1', 's2', 's3', 's4', 's5'])
heights_A

heights_A.shape

(5,)

**Problem 1.2**
Create a series named weights_A with values 85.1, 90.2, 76.8, 80.4, and 78.9, which represent weights of 5 students of class A.

Label each student as s1, s2, s3, s4, and s5.

Determine data type of weights_A and display it.

Hint: Make use of Series method available in pandas library.

In [6]:
wt = [85.1, 90.2, 76.8, 80.4,  78.9,]
weights_A = pd.Series(wt, index = ['s1', 's2', 's3', 's4', 's5'])

print(weights_A)

print(weights_A.shape)

s1    85.1
s2    90.2
s3    76.8
s4    80.4
s5    78.9
dtype: float64
(5,)

# ***Data Frame***

is 2-D shaped and contains data of diff parameters, captured from multiple observations.

Each **observation** is represented by a single **row**, and each **parameter** by a single **column**.

Each column can hold different data type.
Few examples are:

- Height and Weight of all students, belonging to a Class 'C'.
- Daily Rainfall received and Average Temperature of a location 'X', in the year 2017.

---

In [7]:
## Data frame created from pd.Series

s = {'subject': pd.Series(['Math', 'Physics', 'Chemistry']), 'marks': pd.Series([100, 190, 185]) }
df = pd.DataFrame(s)
df

   marks    subject
0    100       Math
1    190    Physics
2    185  Chemistry

In [8]:
## Data frame created from list

s = {'subject': ['Math', 'Physics', 'Chemistry'], 'marks': [100, 190, 185] }
df = pd.DataFrame(s)
df

   marks    subject
0    100       Math
1    190    Physics
2    185  Chemistry

**Problem 1.3**
Create a Data Frame named df_A, which holds the height and weight of five students namely s1, s2, s3, s4 and s5.

Label the columns as Student_height and Student_weight respectively.

Display index values of df_A.

Hint: Make use of DataFrame method in pandas, and also the series heights_A, weights_A created in previous problems.

In [9]:
sf_dict = {'heights': heights_A, 'weights': weights_A }
df_A = pd.DataFrame(sf_dict)
df_A

    heights  weights
s1    176.2     85.1
s2    158.4     90.2
s3    167.6     76.8
s4    156.2     80.4
s5    161.4     78.9

**Problem 1.4**
Create two Series named heights_B and weights_B from two random 1-D numpy arrays with five elements each.

The first array is obtained from the normal distribution of mean 170.0 and standard deviation 25.0.

The second array is derived from the normal distribution of mean 75.0 and standard deviation 12.0.

Label both Series elements with s1, s2, s3, s4 and s5.

In [10]:
heights_B = pd.Series(170 + 25 * np.random.randn(5), index = ['s1', 's2', 's3', 's4', 's5'])
weights_B = pd.Series(75  + 12 * np.random.randn(5), index = ['s1', 's2', 's3', 's4', 's5'])

print(heights_B)

print(weights_B)

s1    172.261866
s2    196.226617
s3    157.873970
s4    205.717917
s5    190.073736
dtype: float64
s1    77.687906
s2    89.315489
s3    84.549867
s4    87.877226
s5    73.787128
dtype: float64

**Problem 1.5**
Create a Data Frame df_B holding height and weight of students s1, s2, s3, s4 and s5 belonging to class B.

Label the columns as Student_height and Student_weight respectively.

Display the column names of df_B.

In [11]:
df_B = pd.DataFrame({'heights': heights_B, 'weigts': weights_B})
df_B

       heights     weigts
s1  172.261866  77.687906
s2  196.226617  89.315489
s3  157.873970  84.549867
s4  205.717917  87.877226
s5  190.073736  73.787128

# **Panel**

holds **two** or **more** Data **Frames** together as a single unit.

Few examples are:

- Height and Weight of all students, belonging to 3 Classes 'A', 'B', and 'C'.
- Daily Rainfall received and Average Temperatures of 3 locations 'X', 'Y', and 'Z' captured in the year 2017.

---

**Problem 1.6**
Create a panel p, which holds previously created two data frames df_A and df_B.

Label the first data frame as ClassA and second as ClassB.


Determine the shape of panel p and display it.

In [12]:
df_panel = pd.Panel({'ClassA': df_A, 'ClassB': df_B})

print('Shape:-')
print(df_panel.shape)

print('\n\nClassA')
print(df_panel.ClassA)


print('\n\nClassB')
print(df_panel.ClassB)

print("\n\ndf_panel:- ")
print(df_panel)

Shape:-
(2, 5, 3)


ClassA
    heights  weights  weigts
s1    176.2     85.1     NaN
s2    158.4     90.2     NaN
s3    167.6     76.8     NaN
s4    156.2     80.4     NaN
s5    161.4     78.9     NaN


ClassB
       heights  weights     weigts
s1  172.261866      NaN  77.687906
s2  196.226617      NaN  89.315489
s3  157.873970      NaN  84.549867
s4  205.717917      NaN  87.877226
s5  190.073736      NaN  73.787128


df_panel:-
<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 5 (major_axis) x 3 (minor_axis)
Items axis: ClassA to ClassB
Major_axis axis: s1 to s5
Minor_axis axis: heights to weigts

# Data Access

Data Access refers to extracting data present in defined data structures.

Pandas provide utilities like **loc** and **iloc** to get data from a Series, a DataFrame, or a Panel.

**Problem 2.1**

Print the second element of series heights_A, as a string.

In [13]:
#Using index
print (heights_A[1])

#Using get() and index
print (heights_A.get(1))


#Using get() and index variable name
print (heights_A.get('s2'))

158.4
158.4
158.4

**Problem 2.2**

Obtain central three elements of Series heights_A.

In [14]:
print (heights_A[1:-1])

s2    158.4
s3    167.6
s4    156.2
dtype: float64

**Accessing Data from a Data Frame**

Pandas allows .loc, .iloc methods for selecting rows.

Using square brackets ([ ]) is also allowed, especially for selecting columns.

**Problem 2.3**

Select the column of df_A, referring to student heights and store in variable height.

Display the type of height

In [15]:
print(df_A)

height = df_A['heights']

print('\n\nheight:')
print(height)


print('\n\n Type of Height')
print(type(height))   ## You could also use print(type(_))   _ refers to latest one

    heights  weights
s1    176.2     85.1
s2    158.4     90.2
s3    167.6     76.8
s4    156.2     80.4
s5    161.4     78.9


height:
s1    176.2
s2    158.4
s3    167.6
s4    156.2
s5    161.4
Name: heights, dtype: float64


 Type of Height
<class 'pandas.core.series.Series'>

**Problem 2.4**

Select the rows corresponding to students s1, s2 of df_A and display them.

In [16]:
df_A[:2]

    heights  weights
s1    176.2     85.1
s2    158.4     90.2

In [17]:
print(df_A.loc['s1'])

print(df_A.loc['s2'])

heights    176.2
weights     85.1
Name: s1, dtype: float64
heights    158.4
weights     90.2
Name: s2, dtype: float64

**Problem 2.5**

Select the rows corresponding to students s1, s2 and s5 of df_A in the order s2, s5, s1 and display them.

In [18]:
df_A.loc[['s2', 's5', 's1']]

    heights  weights
s2    158.4     90.2
s5    161.4     78.9
s1    176.2     85.1

**# Problem 2.6**

whats the difference between loc and iloc?.


loc gets rows (or columns) with particular labels from the index. iloc gets rows (or columns) at particular positions in the index (so it only takes integers). ix usually tries to behave like loc but falls back to behaving like iloc if a label is not present in the index.

In [19]:
df_p26 = pd.DataFrame({'A':[34, 78, 54], 'B':[12, 67, 43]}, index=['r1', 'r2', 'r3'])

print(df_p26.iloc[1:3])   #### taking integer index as input 
 
print(df_p26.loc['r2':'r3'])   #### taking given string index as input

     A   B
r2  78  67
r3  54  43
     A   B
r2  78  67
r3  54  43

**Problem 2.7**


How do you add a new column 'C' to a data frame as similar to the previous one, with 3 rows

In [20]:
df_p26['C'] = [12, 98, 45]
df_p26

     A   B   C
r1  34  12  12
r2  78  67  98
r3  54  43  45

**Problem 2.8**

How do you delete a column from a data fram?

In [21]:
del df_p26['B']
df_p26

     A   C
r1  34  12
r2  78  98
r3  54  45

# Knowing a Series

It is possible to understand a Series better by using ***describe*** method.

The method provides details like mean, std, etc. about a series.

In [22]:
temp = pd.Series(28 + 10*np.random.randn(10))

print(temp.describe())

count    10.000000
mean     32.223512
std      11.076904
min      10.876127
25%      27.558101
50%      35.376808
75%      40.824349
max      43.679548
dtype: float64

# Knowing a DataFrame

Two methods majorly ***info*** and ***describe*** can be used to know about the data, present in a data frame.

- **describe** method by default provides details of **only** ***numeric*** fields.
- You can use ***include*** argument to know about other columns.

In [23]:
df = pd.DataFrame({
    'temp':pd.Series(28 + 10*np.random.randn(10)), 
    'rain':pd.Series(100 + 50*np.random.randn(10)),
    'location':list('AAAAABBBBB')
})

print(df.info(), end= "\n\n")

print(df.describe(), end='\n\n')

print(df.describe(include=['object', 'float64']))  ### object is used to include location

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
location    10 non-null object
rain        10 non-null float64
temp        10 non-null float64
dtypes: float64(2), object(1)
memory usage: 320.0+ bytes
None

             rain       temp
count   10.000000  10.000000
mean    93.460056  24.592424
std     39.736703   7.878133
min     47.774562  12.217828
25%     60.369562  20.712235
50%     90.970472  23.333531
75%    123.089723  27.264286
max    148.915178  41.850678

       location        rain       temp
count        10   10.000000  10.000000
unique        2         NaN        NaN
top           B         NaN        NaN
freq          5         NaN        NaN
mean        NaN   93.460056  24.592424
std         NaN   39.736703   7.878133
min         NaN   47.774562  12.217828
25%         NaN   60.369562  20.712235
50%         NaN   90.970472  23.333531
75%         NaN  123.089723  27.264286
max         NaN  148.915178  41.850678

# Pandas I/O

- pandas.read_csv()                   --> mainly path in  qoutes, delimitter
- pandas.read_excel()
- pandas.read_sql_table
- pandas.read_json()
- pandas.DataFrame.to_csv()     --> 
- pandas.DataFrame.to_excel()

In [24]:
# You can always put ?pd.read_csv enter to get what the function requires

df_IO = pd.DataFrame({'A': pd.Series([10,20,30]), 'B':pd.Series([90,100,80])})
print(df_IO)

df_IO.to_csv("app.csv")

    A    B
0  10   90
1  20  100
2  30   80

# How to read csv file from an url

In [25]:
import urllib.request as ur

file = ur.urlopen(ur.Request("https://raw.githubusercontent.com/uiuc-cse/data-fa14/gh-pages/data/iris.csv"))

data = pd.read_csv(file, sep = ',' , header  = None, decimal= '.', names = ['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'target'])

data.head(10)

   sepal_length  sepal_width  petal_length  petal_width   target
0  sepal_length  sepal_width  petal_length  petal_width  species
1           5.1          3.5           1.4          0.2   setosa
2           4.9            3           1.4          0.2   setosa
3           4.7          3.2           1.3          0.2   setosa
4           4.6          3.1           1.5          0.2   setosa
5             5          3.6           1.4          0.2   setosa
6           5.4          3.9           1.7          0.4   setosa
7           4.6          3.4           1.4          0.3   setosa
8             5          3.4           1.5          0.2   setosa
9           4.4          2.9           1.4          0.2   setosa

To read from mysql database you can use below commands. Since I don't have mysql database loaded here just showing the code snippet required.

`from sqlalchemy import create_engine`

`engine = create_engine('mysql+localhost:8888/table')`

`df = pd.read_sql_table('Table:', engine)`
`df`

# **How to deal with large datasets in smaller chunks**

- Set the **iterator** to True in pandas methods
- use the **get_chunk()** to receive data.

In [26]:
import urllib.request as ur

file = ur.urlopen(ur.Request("https://raw.githubusercontent.com/uiuc-cse/data-fa14/gh-pages/data/iris.csv"))

data_iterator = pd.read_csv(file, sep = ',' , header  = None, decimal= '.', names = ['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'target'], 
                            iterator = True)

chunk = [data_iterator.get_chunk(100), data_iterator.get_chunk(5), data_iterator.get_chunk(2)]

chunk[2]

     sepal_length  sepal_width  petal_length  petal_width     target
105           6.5            3           5.8          2.2  virginica
106           7.6            3           6.6          2.1  virginica

**Reading Data from Json**

pandas provides the utilities read_json and to_json to deal with JSON strings or files.

In [27]:
import urllib.request as ur

file = ur.urlopen(ur.Request("https://raw.githubusercontent.com/whatsupabhijit/py_rambling/master/pandas/contact.json"))

##
## If you don't want to take from url and simply declare in your code
## then import json and use json.dumps(give your json variable name here)
#
# import json
# person = [your json goes here]
# person_json_str = json.dumps(person)
# df_json = pd.read_json(person_json_str)
#

df_json = pd.read_json(file)

df_json.head(1)

,_id,about,address,age,balance,company,email,eyeColor,favoriteFruit,friends,...,guid,index,isActive,latitude,longitude,name,phone,picture,registered,tags
0,5bf8e6475fc62129cdf61a9a,Voluptate fugiat ut nisi aute adipisicing volu...,"526 Oliver Street, Edgar, Delaware, 6455",32,"$3,010.22",ENORMO,hodgesrivera@enormo.com,green,strawberry,"[{'id': 0, 'name': 'Berta Hays'}, {'id': 1, 'n...",...,90ae433a-6ad4-438d-a6c7-d8668d9df7ef,0,True,38.115627,-21.175877,Hodges Rivera,+1 (933) 471-2714,http://placehold.it/32x32,2018-01-30T09:25:45 -08:00,"[esse, minim, reprehenderit, ullamco, consequa..."

In [0]:
#?pd.DataFrame.to_csv
?pd.read_csv

# Indexing

Till now have seen very basic indexing of rows or columns. But pandas provide more. Letss see what we can index and how.

# Single Level Indexing

till now we have seen when data frame object was created we passed one index ***paramter***. 
We can still do that. 

But DataFrame also has index as an attribute. Once dataframe is created you can set the index ***attribute*** later.

In [29]:
row = 5
col = 3

df = pd.DataFrame(np.random.rand(row,col))

df.index = [ 'row#' + str(i) for i in range(1, row+1) ]

df

              0         1         2
row#1  0.553042  0.191682  0.563871
row#2  0.633005  0.179272  0.598244
row#3  0.492613  0.916479  0.356003
row#4  0.227974  0.616826  0.165041
row#5  0.578838  0.640924  0.507298

# Date Level Indexing

How to create a date range from any day of specified perio and freequency

- **date_range**
- **to_datetime**

More at [here](http://pandas.pydata.org/pandas-docs/stable/timeseries.html)

In [30]:

print("These are the 10 days" , pd.date_range('1/1/2018', periods=10, freq='D'))
print("These are the 5 months" , pd.date_range('1/1/2018', periods=5, freq='M'))
print("These are the 3 years" , pd.date_range('1/1/2018', periods=3, freq='Y'))
print("These are the 3 weeks" , pd.date_range('1/1/2018', periods=3, freq='W'))
print("These are the 4 Business Quarters" , pd.date_range('1/1/2018', periods=4, freq='BQ'))

These are the 10 days DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10'],
              dtype='datetime64[ns]', freq='D')
These are the 5 months DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
               '2018-05-31'],
              dtype='datetime64[ns]', freq='M')
These are the 3 years DatetimeIndex(['2018-12-31', '2019-12-31', '2020-12-31'], dtype='datetime64[ns]', freq='A-DEC')
These are the 3 weeks DatetimeIndex(['2018-01-07', '2018-01-14', '2018-01-21'], dtype='datetime64[ns]', freq='W-SUN')
These are the 4 Business Quarters DatetimeIndex(['2018-03-30', '2018-06-29', '2018-09-28', '2018-12-31'], dtype='datetime64[ns]', freq='BQ-DEC')

In [31]:
#Date values with formatting

print(pd.to_datetime(['20180310', '20181214', 'stringnotindateformat'], format='%Y%m%d', errors='coerce'), end = '\n\n') # NaT - Not a Time

print(pd.to_datetime(pd.Series(['Jul 31, 2009', '2010-01-10', None])))

DatetimeIndex(['2018-03-10', '2018-12-14', 'NaT'], dtype='datetime64[ns]', freq=None)

0   2009-07-31
1   2010-01-10
2          NaT
dtype: datetime64[ns]

**All is fine but how is it related to DataFrame**

In [32]:
df_index = pd.DataFrame({'year': [2014, 2015], 'month': [7,2], 'day': [28,16]})

pd.to_datetime(df_index)

0   2014-07-28
1   2015-02-16
dtype: datetime64[ns]

In [0]:
?pd.date_range

# Multi Level Indexing / Hierarchical indexing

We have seen single level indexing. Now we will see hierarchical indexing.

To deal with this we need to create Multi Level object.

In [34]:
lists = [['Abhijit', 'Abhijit',   'Abhijit', 'Joyee', 'Joyee'],
         ['won',      'lost',   'won',     'lost',    'won']]


m_index = pd.MultiIndex.from_arrays(lists, names = ['name' , 'game'])

m_index

#Now you can use this multi level index in your Series/DataFrame

m_series = pd.Series(np.random.randn(5)*100 % 100, index=m_index)
m_series

name     game
Abhijit  won     57.994366
         lost    22.944533
         won     12.846801
Joyee    lost    94.693540
         won     66.287617
dtype: float64

In [35]:
m_series['Abhijit']

game
won     57.994366
lost    22.944533
won     12.846801
dtype: float64

In [36]:
m_series['Abhijit','won']

(Abhijit, won)    57.994366
(Abhijit, won)    12.846801
dtype: float64

**Indexing Summary **

1. Create an index named dates, representing a range of dates starting from 1-Sep-2017 to 15-Sep-2017.

2. Convert the following list of date strings into datetime objects. Capture the result in search_dates

                    datelist = ['14-Sep-2017', '9-Sep-2017']

3. Filter those index dates from dates which match dates in search_dates. Display the filtered dates.  

     Hint: use isin method associated with DatetimeIndex objects.
     

4. Add 1 hours 2 Days to the filtered days and display it


5. Create a multi index named mi_index of two levels, represented in the below array arraylist. Display levels of mi_index.

                      `arraylist = [['classA'] * 5 + ['classB'] * 5, ['s1', 's2', 's3','s4', 's5'] * 2]`

In [37]:
#1
dates = pd.date_range('9/1/2017', periods=15, freq = 'D')
print(dates, end='\n\n')

#2
datelist = ['14-Sep-2017', '9-Sep-2017']
search_dates = pd.to_datetime(datelist)
print(search_dates, end= '\n\n')


#3
filtered_dates_bool = dates.isin(search_dates)
#print (filtered_dates_bool, end='\n\n')

filtered_dates = dates[filtered_dates_bool]
print (filtered_dates, end='\n\n')

#4
print(filtered_dates + pd.Timedelta('1 days 2 hours'), end='\n\n')

#5
arraylist = [['classA'] * 5 + ['classB'] * 5, ['s1', 's2', 's3','s4', 's5'] * 2]
mi_index = pd.MultiIndex.from_arrays(arraylist)
print(mi_index.levels)

DatetimeIndex(['2017-09-01', '2017-09-02', '2017-09-03', '2017-09-04',
               '2017-09-05', '2017-09-06', '2017-09-07', '2017-09-08',
               '2017-09-09', '2017-09-10', '2017-09-11', '2017-09-12',
               '2017-09-13', '2017-09-14', '2017-09-15'],
              dtype='datetime64[ns]', freq='D')

DatetimeIndex(['2017-09-14', '2017-09-09'], dtype='datetime64[ns]', freq=None)

DatetimeIndex(['2017-09-09', '2017-09-14'], dtype='datetime64[ns]', freq=None)

DatetimeIndex(['2017-09-10 02:00:00', '2017-09-15 02:00:00'], dtype='datetime64[ns]', freq=None)

[['classA', 'classB'], ['s1', 's2', 's3', 's4', 's5']]

In [38]:
pd.bdate_range('11-Sep-2017', '17-Sep-2017', freq='2D')

DatetimeIndex(['2017-09-11', '2017-09-13', '2017-09-15', '2017-09-17'], dtype='datetime64[ns]', freq='2D')

In [39]:
pd.period_range('11-Sep-2017', '17-Sep-2017', freq='M')

PeriodIndex(['2017-09'], dtype='period[M]', freq='M')

In [40]:
d = pd.date_range('11-Sep-2017', '17-Sep-2017', freq='2D')
print(d + pd.Timedelta('1 days 2 hours'))

DatetimeIndex(['2017-09-12 02:00:00', '2017-09-14 02:00:00',
               '2017-09-16 02:00:00', '2017-09-18 02:00:00'],
              dtype='datetime64[ns]', freq='2D')

# Data Cleaning 

Data Cleaning alludes to change of crude information to a helpful organized shape, which is utilized for further examination. 

The procedure incorporates different ways like managing missing fields, removing duplicates etc.

- Remove **duplicate** records
  `d = d.drop_duplicates()`
  
- **Missing** Values
  - **Find** missing values
  `d['col_name'].isnull().value_counts()`
  
  - **Remove** all rows with missing values
  `d = d.dropna(how='any')`
  
  - **Replace** missing data
  `d = d.fillna(0)
    d  =  d.fillna(method='pad')
    d  =  d.fillna(df.mean())`
  
- **Extract** data from a existing column and put into a new column (use regular expression to copy first word)
 `df['new_col_name'] = df['existing_col_name'].str.extract('\W+')`
 
- **Replace** data
`df['existing_col_name'] = df['existing_col_name'].str.replace('^Abhi', 'Joyee')`

- **Filter** specific rows
`df[df['col_name'] == 'somevalue']`

**Summary Data Cleaning **


1. Set height and weight values of student s3 to NaN in the data frame df_A
2. Also set the weight of s5 to NaN in df_A.
3. Drop the rows having null values in any of the columns and assign the result to df_drop.
4. Display df_drop index.

In [41]:
print(df_A, end='\n\n\n')

#1
df_A.loc['s3', 'heights'] = np.nan
df_A.loc['s3', 'weights'] = np.nan

#2
df_A.loc['s5', 'weights'] = np.nan

#3
print(df_A, end='\n\n\n')

df_drop = df_A.dropna(how='any')

print(df_drop, end='\n\n\n')

#4
df_drop.index

    heights  weights
s1    176.2     85.1
s2    158.4     90.2
s3    167.6     76.8
s4    156.2     80.4
s5    161.4     78.9


    heights  weights
s1    176.2     85.1
s2    158.4     90.2
s3      NaN      NaN
s4    156.2     80.4
s5    161.4      NaN


    heights  weights
s1    176.2     85.1
s2    158.4     90.2
s4    156.2     80.4

Index(['s1', 's2', 's4'], dtype='object')

# Data Aggregation

Data aggregation is useful when you want to group some data together based on certain condition.

You can create such group and make a comparative study.

- **Filtering examples:-**

In [42]:
file = ur.urlopen(ur.Request("https://raw.githubusercontent.com/uiuc-cse/data-fa14/gh-pages/data/iris.csv"))

data = pd.read_csv(file, sep = ',' , skiprows=1, decimal= '.', names = ['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'target'])

print(type(data))

print ("Total Count")
print(data['target'].count())

print('setoa count')
setoa = data[data['target'] == 'setosa'] 
print(setoa['target'].count())


print(setoa['petal_length'].min())
print(setoa['petal_length'].median())
print(setoa['petal_length'].mode())
print(setoa['petal_length'].std())

<class 'pandas.core.frame.DataFrame'>
Total Count
150
setoa count
50
1.0
1.5
0    1.5
dtype: float64
0.17351115943644546

- ** Transforming examples**

In [43]:
df_bef = pd.DataFrame({'temp':pd.Series(28 + 10*np.random.randn(10)),

                   'rain':pd.Series(100 + 50*np.random.randn(10)),

                   'location':list('AAAAABBBBB')

})

print('Before replacements')
print(df_bef, end = '\n\n')

# define replacement dictionary
replacements = {

'location': {'A':'Hyderabad', 'B':'Mumbai'}

}

df_rpl = df_bef.replace(replacements, regex=True)

print(df_rpl, end = '\n\n')


#you can also use replacement based on specific pattern

mumbai_replacements = df_rpl.loc[df_rpl.location.str.contains('umb'),:]
print(mumbai_replacements)

Before replacements
  location        rain       temp
0        A   17.833840  37.035950
1        A  168.629962  33.981091
2        A  137.165593  23.350218
3        A   83.203686  20.329317
4        A  104.351543  40.098851
5        B  129.751196  35.672528
6        B   47.324938  20.718228
7        B  105.115317  33.088058
8        B  113.433534  34.860082
9        B   91.596515  35.718464

    location        rain       temp
0  Hyderabad   17.833840  37.035950
1  Hyderabad  168.629962  33.981091
2  Hyderabad  137.165593  23.350218
3  Hyderabad   83.203686  20.329317
4  Hyderabad  104.351543  40.098851
5     Mumbai  129.751196  35.672528
6     Mumbai   47.324938  20.718228
7     Mumbai  105.115317  33.088058
8     Mumbai  113.433534  34.860082
9     Mumbai   91.596515  35.718464

  location        rain       temp
5   Mumbai  129.751196  35.672528
6   Mumbai   47.324938  20.718228
7   Mumbai  105.115317  33.088058
8   Mumbai  113.433534  34.860082
9   Mumbai   91.596515  35.718464

- ** Grouping examples**

In [44]:
regions = df_rpl.groupby('location')

print(regions.mean())

                 rain       temp
location
Hyderabad  102.236925  30.959086
Mumbai      97.444300  32.011472

**Data Grouping summary**

1. Filter the rows from df_A, whose Student_height > 160.0 and Student_weight < 80.0 and display the filtered rows.
2. Filter the rows from df_A, whose index values end with 5 and display them.
3. Create a new column Gender in data frame df_A using the below command.
     `df_A['Gender'] = ['M', 'F', 'M', 'M', 'F']``
     
4. Group df_A based on Gender and calculated mean height and weight of each group.
5. Print the column 0th and 1st column using lambda() from df_A

In [48]:
#1
print(df_A, end ='\n\n')
df_st = df_A[(df_A['heights'] > 160) & (df_A['weights'] > 80)]
print(df_st,  end ='\n\n')

#2
#print(df_A.index.)


#3
df_A['Gender'] = ['M', 'F', 'M', 'M', 'F']
print(df_A,  end ='\n\n')


#4
genders = df_A.groupby('Gender')
print(genders.mean(),  end ='\n\n')

#5
print(df_A.iloc[:, lambda x : [0,1]],  end ='\n\n')

#print(df_ind,  end ='\n\n')

    heights  weights
s1    176.2     85.1
s2    158.4     90.2
s3      NaN      NaN
s4    156.2     80.4
s5    161.4      NaN

    heights  weights
s1    176.2     85.1

    heights  weights Gender
s1    176.2     85.1      M
s2    158.4     90.2      F
s3      NaN      NaN      M
s4    156.2     80.4      M
s5    161.4      NaN      F

        heights  weights
Gender
F         159.9    90.20
M         166.2    82.75

    heights  weights
s1    176.2     85.1
s2    158.4     90.2
s3      NaN      NaN
s4    156.2     80.4
s5    161.4      NaN

# Data Merging

- `Data` Merging refers to combining data stored in multiple entities based on a specific criteria.

- Pandas provides utilities like merge, which is used to merge two or more data frames.

In [50]:
df1 = pd.DataFrame({'org': [111, 747, 777, 888, 638], 'logo': [1, 2, 3, 1, 1], 'key': ['K0', 'K1', 'K2', 'K3', 'K4']})
df2 = pd.DataFrame({'org': [112, 748, 778, 889, 639], 'logo': [10, 20, 30, 10, 10], 'key': ['K0', 'K1', 'K2', 'K3', 'K4']})
df1

  key  logo  org
0  K0     1  111
1  K1     2  747
2  K2     3  777
3  K3     1  888
4  K4     1  638

In [51]:
pd.DataFrame.merge(df1, df2, on='key')

  key  logo_x  org_x  logo_y  org_y
0  K0       1    111      10    112
1  K1       2    747      20    748
2  K2       3    777      30    778
3  K3       1    888      10    889
4  K4       1    638      10    639

In [55]:
df2 = pd.DataFrame({'org': [112, 748, 778, 889], 'logo': [10, 20, 30, 10], 'key': ['K0', 'K1', 'K4', 'K3']})
pd.DataFrame.merge(df1, df2, on='key', how='left') 

## if you had to match on two columns you can give that by on=['key1' , 'key2']

  key  logo_x  org_x  logo_y  org_y
0  K0       1    111    10.0  112.0
1  K1       2    747    20.0  748.0
2  K2       3    777     NaN    NaN
3  K3       1    888    10.0  889.0
4  K4       1    638    30.0  778.0

Create a Series s, from a list [165.4, 82.7, 'F'].

Provide the following list of values to argument index.

`['Student_height', 'Student_weight', 'Gender']`
`

provide s6 as value to argument name.

Append the series s to data frame df_A and store the captured array in df_AA.

Display index values of df_AA.

In [64]:
s = pd.Series([165.4, 82.7, 'F'])

df_B = df_A.append(s, ignore_index = True, index=['Student_height', 'Student_weight', 'Gender'] )
df_B

TypeError: ignored

Change the index of df_B to [ 's6', 's7', 's8', 's9', 's10']

Create the Gender column in df_B with values ['F', 'M', 'F', 'F', 'M']

Concatenate two data frames df_A and df_B and assign the result to df.

Hint: use concat method of pandas.

Create the following Series.

nameid = pd.Series(range(101, 111))

name = pd.Series(['person' + str(i) for i in range(1, 11)])

Create the data frame master with series nameid and name

Create the data frame transaction using below command.

transaction = pd.DataFrame({'nameid':[108, 108, 108,103], 'product':['iPhone', 'Nokia', 'Micromax', 'Vivo']})
Merge master and transaction on nameid and display the merged data frame. perform inner join.

Hint: use merge method